---
kind: other
id: Methods.T:Autodesk.Revit.DB.ViewFamilyType
source: html/2e8a6971-0cf4-903c-cef4-db0d4a48543c.htm
---
# ViewFamilyType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.